<?php

// *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К»

const REGIONS = [
    'Московская область' => [
        'Москва', 'Зеленоград', 'Клин'
    ],
    'Ленинградская область' => [
        'Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'
    ],
    'Рязанская область' => [
        'Рязань', 'Скопин', 'Пронск', 'Новомичуринск'
    ]
];

$k = 'К';

foreach (REGIONS as $region => $cities) {
    foreach ($cities as $city) {
        if (mb_strpos ($city, 'К') === 0) {
            echo $region.': <br>'.$city.'<br>';
        }; 
    }
}